Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/startup_MIMXRT118C_cm33.s
ISR_HANDLER2 LPTMR3                               // LPTMR3_IRQHandler                                - LPTMR3 interrupt
ISR_HANDLER2 TMR4                                 // TMR4_IRQHandler                                  - TMR4 interrupt
ISR_RESERVED                                      // Reserved168_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 LPI2C6                               // LPI2C6_IRQHandler                                - LPI2C6 interrupt
ISR_HANDLER2 SAI4                                 // SAI4_IRQHandler                                  - SAI4 interrupt
ISR_HANDLER2 SPDIF                                // SPDIF_IRQHandler                                 - SPDIF interrupt
ISR_RESERVED                                      // Reserved172_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // Reserved173_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // Reserved174_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // Reserved175_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 INTG_BOOTROM_DEBUG_CTRL              // INTG_BOOTROM_DEBUG_CTRL_IRQHandler               - CM33, CM7, DAP access IRQ
ISR_HANDLER2 EDGELOCK_REQ1                        // EDGELOCK_REQ1_IRQHandler                         - Edgelock reuqest 1 interrupt
ISR_HANDLER2 EDGELOCK_REQ2                        // EDGELOCK_REQ2_IRQHandler                         - Edgelock reuqest 2 interrupt
ISR_HANDLER2 EDGELOCK_REQ3                        // EDGELOCK_REQ3_IRQHandler                         - Edgelock reuqest 3 interrupt
ISR_HANDLER2 TMR3                                 // TMR3_IRQHandler                                  - TMR3 interrupt
ISR_HANDLER2 JTAGC                                // JTAGC_IRQHandler                                 - JTAGC SRC reset source
ISR_HANDLER2 M33_SYSRESET_REQ                     // M33_SYSRESET_REQ_IRQHandler                      - CM33 SYSREQRST SRC reset source
ISR_HANDLER2 M33_LOCKUP                           // M33_LOCKUP_IRQHandler                            - CM33 LOCKUP SRC reset source
ISR_HANDLER2 M7_SYSRESET_REQ                      // M7_SYSRESET_REQ_IRQHandler                       - CM33 SYSREQRST SRC reset source
ISR_HANDLER2 M7_LOCKUP                            // M7_LOCKUP_IRQHandler                             - CM33 LOCKUP SRC reset source
ISR_HANDLER2 PWM2_FAULT                           // PWM2_FAULT_IRQHandler                            - PWM2 fault or reload error interrupt
ISR_HANDLER2 PWM2_0                               // PWM2_0_IRQHandler                                - PWM2 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM2_1                               // PWM2_1_IRQHandler                                - PWM2 capture 1, compare 1, or reload 1 interrupt
ISR_HANDLER2 PWM2_2                               // PWM2_2_IRQHandler                                - PWM2 capture 2, compare 2, or reload 2 interrupt
ISR_HANDLER2 PWM2_3                               // PWM2_3_IRQHandler                                - PWM2 capture 3, compare 3, or reload 3 interrupt
ISR_HANDLER2 PWM3_FAULT                           // PWM3_FAULT_IRQHandler                            - PWM3 fault or reload error interrupt
ISR_HANDLER2 PWM3_0                               // PWM3_0_IRQHandler                                - PWM3 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM3_1                               // PWM3_1_IRQHandler                                - PWM3 capture 1, compare 1, or reload 1 interrupt
ISR_HANDLER2 PWM3_2                               // PWM3_2_IRQHandler                                - PWM3 capture 2, compare 2, or reload 2 interrupt
ISR_HANDLER2 PWM3_3                               // PWM3_3_IRQHandler                                - PWM3 capture 3, compare 3, or reload 3 interrupt
ISR_HANDLER2 PWM4_FAULT                           // PWM4_FAULT_IRQHandler                            - PWM4 fault or reload error interrupt
ISR_HANDLER2 PWM4_0                               // PWM4_0_IRQHandler                                - PWM4 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM4_1                               // PWM4_1_IRQHandler                                - PWM4 capture 1, compare 1, or reload 1 interrupt
ISR_HANDLER2 PWM4_2                               // PWM4_2_IRQHandler                                - PWM4 capture 2, compare 2, or reload 2 interrupt
ISR_HANDLER2 PWM4_3                               // PWM4_3_IRQHandler                                - PWM4 capture 3, compare 3, or reload 3 interrupt
ISR_HANDLER2 EQDC1                                // EQDC1_IRQHandler                                 - EQDC1 interrupt
ISR_HANDLER2 EQDC2                                // EQDC2_IRQHandler                                 - EQDC2 interrupt
ISR_HANDLER2 EQDC3                                // EQDC3_IRQHandler                                 - EQDC3 interrupt
ISR_HANDLER2 EQDC4                                // EQDC4_IRQHandler                                 - EQDC4 interrupt
ISR_HANDLER2 ADC2                                 // ADC2_IRQHandler                                  - ADC2 interrupt
ISR_HANDLER2 DCDC                                 // DCDC_IRQHandler                                  - DCDC brown out interrupt
ISR_HANDLER2 CAN3                                 // CAN3_IRQHandler                                  - CAN3 interrupt
ISR_HANDLER2 CAN3_ERROR                           // CAN3_ERROR_IRQHandler                            - CAN3 error interrupt
ISR_HANDLER2 DAC                                  // DAC_IRQHandler                                   - DAC interrupt
ISR_HANDLER2 LPSPI5                               // LPSPI5_IRQHandler                                - LPSPI5 interrupt
ISR_HANDLER2 LPSPI6                               // LPSPI6_IRQHandler                                - LPSPI6 interrupt
ISR_HANDLER2 LPUART7                              // LPUART7_IRQHandler                               - LPUART7 interrupt
ISR_HANDLER2 LPUART8                              // LPUART8_IRQHandler                               - LPUART8 interrupt
ISR_HANDLER2 SAI2                                 // SAI2_IRQHandler                                  - SAI2 interrupt
ISR_RESERVED                                      // Reserved215_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // Reserved216_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // Reserved217_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 ACMP3                                // ACMP3_IRQHandler                                 - CMP3 interrupt
ISR_RESERVED                                      // Reserved219_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 CM7_PS                               // CM7_PS_IRQHandler                                - M7 PS Tag/Data Parity Error
ISR_HANDLER2 CM7_MCM                              // CM7_MCM_IRQHandler                               - M7 MCM interrupt
ISR_HANDLER2 CM33_MCM                             // CM33_MCM_IRQHandler                              - M33 MCM interrupt
ISR_HANDLER2 ECAT_INT                             // ECAT_INT_IRQHandler                              - EtherCAT interrupt
ISR_HANDLER2 SAFETY_CLK_MON                       // SAFETY_CLK_MON_IRQHandler                        - Safety clock monitor interrupt
ISR_HANDLER2 GPT1                                 // GPT1_IRQHandler                                  - GPT1 interrupt
ISR_HANDLER2 GPT2                                 // GPT2_IRQHandler                                  - GPT2 interrupt
ISR_HANDLER2 KPP                                  // KPP_IRQHandler                                   - KPP interrupt
ISR_HANDLER2 USBPHY1                              // USBPHY1_IRQHandler                               - USBPHY1 interrupt
ISR_RESERVED                                      // Reserved229_IRQHandler                           - Reserved interrupt
ISR_RESERVED                                      // Reserved230_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 USB_OTG1                             // USB_OTG1_IRQHandler                              - USBOTG1 interrupt
ISR_HANDLER2 FLEXSPI_SLV                          // FLEXSPI_SLV_IRQHandler                           - FLEXSPI follower interrupt
ISR_RESERVED                                      // Reserved233_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 MSGINTR1                             // MSGINTR1_IRQHandler                              - MSGINTR1 interrupt
ISR_HANDLER2 MSGINTR2                             // MSGINTR2_IRQHandler                              - MSGINTR2 interrupt
ISR_HANDLER2 MSGINTR3                             // MSGINTR3_IRQHandler                              - MSGINTR3 interrupt
ISR_HANDLER2 MSGINTR4                             // MSGINTR4_IRQHandler                              - MSGINTR4 interrupt
ISR_HANDLER2 MSGINTR5                             // MSGINTR5_IRQHandler                              - MSGINTR5 interrupt
ISR_HANDLER2 MSGINTR6                             // MSGINTR6_IRQHandler                              - MSGINTR6 interrupt
ISR_HANDLER2 SINC1_CH0                            // SINC1_CH0_IRQHandler                             - SINC Filter Glue 1 channel 0
ISR_HANDLER2 SINC1_CH1                            // SINC1_CH1_IRQHandler                             - SINC Filter Glue 1 channel 1
ISR_HANDLER2 SINC1_CH2                            // SINC1_CH2_IRQHandler                             - SINC Filter Glue 1 channel 2
ISR_HANDLER2 SINC1_CH3                            // SINC1_CH3_IRQHandler                             - SINC Filter Glue 1 channel 3
ISR_HANDLER2 SINC2_CH0                            // SINC2_CH0_IRQHandler                             - SINC Filter Glue 2 channel 0
ISR_HANDLER2 SINC2_CH1                            // SINC2_CH1_IRQHandler                             - SINC Filter Glue 2 channel 1
ISR_HANDLER2 SINC2_CH2                            // SINC2_CH2_IRQHandler                             - SINC Filter Glue 2 channel 2
ISR_HANDLER2 SINC2_CH3                            // SINC2_CH3_IRQHandler                             - SINC Filter Glue 2 channel 3
ISR_HANDLER2 GPIO4                                // GPIO4_IRQHandler                                 - GPIO4 interrupt
ISR_HANDLER2 TMR2                                 // TMR2_IRQHandler                                  - TMR2 interrupt
ISR_HANDLER2 GPIO5                                // GPIO5_IRQHandler                                 - GPIO5 interrupt
ISR_HANDLER2 ASRC                                 // ASRC_IRQHandler                                  - ASRC interrupt
ISR_HANDLER2 GPIO6                                // GPIO6_IRQHandler                                 - GPIO6 interrupt
ISR_HANDLER2 DBG_TRACE                            // DBG_TRACE_IRQHandler                             - JTAGSW DAP MDM-AP SRC reset source
ISR_HANDLER2 ECAT_RST_OUT                         // ECAT_RST_OUT_IRQHandler                          - ECAT reset out interrupt
ISR_RESERVED                                      // DefaultISR                                       - 255

  .section .vectors, "ax"
_vectors_end:

#if defined VECTORS_IN_RAM && defined XIP_EXTERNAL_FLASH
  .section .vectors_ram, "ax"
_vectors_ram:
  .space _vectors_end-_vectors, 0
#endif

